1s/ERP/extensions/liko/DataProcessors/ПеремещениеТоваровДоп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПеремещениеТоваровДоп</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

1s/ERP/extensions/liko/InformationRegisters/Лико_СерииНоменклатурыДоп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_СерииНоменклатурыДоп</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЗапаса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/extensions/liko/Catalogs/ЯССМ_ОбъектыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЯССМ_ОбъектыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Втулка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Втулки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Уникальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Рулонный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеКороткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КатегорияТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УпотребитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидКонтактаСПищевойПродукцией</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыКонтактовСПищевойПродукцией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстаточныйСрокГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/extensions/liko/DataProcessors/ПеремещениеТоваровДоп/Ext/ObjectModule.bsl
&Вместо("СформироватьДанныеЗаполненияПоЛико_БланкЭтапа")
Процедура Лико_СформироватьДанныеЗаполненияПоЛико_БланкЭтапа(ДанныеСформированы)
	
		
	Если ДанныеСформированы  
		Или  ТипЗнч(Основание) <> Тип("ДокументОбъект.Лико_БланкЭтапа") Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Номенклатура КАК Номенклатура,
	|	Лико_БланкЭтапаТовары.Характеристика КАК Характеристика,
	|	Лико_БланкЭтапаТовары.Упаковка КАК Упаковка,
	|	Лико_БланкЭтапаТовары.ВозвратКоличество КАК КоличествоСим,
	|	Лико_БланкЭтапаТовары.ВозвратКоличествоУУ КАК Количество,
	|	Лико_БланкЭтапаТовары.СкладОтправитель КАК СкладОтправитель,
	|	Лико_БланкЭтапаТовары.СкладПолучатель КАК СкладПолучатель,
	|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	|	Лико_БланкЭтапаТовары.ВозвратКоличествоУУ КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ВтСерии
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаТовары.СкладОтправитель <> Лико_БланкЭтапаТовары.СкладПолучатель
	|	И Лико_БланкЭтапаТовары.ВозвратКоличествоУУ > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Лико_БланкЭтапаВыпуск.Номенклатура,
	|	Лико_БланкЭтапаВыпуск.Характеристика,
	|	Лико_БланкЭтапаВыпуск.Упаковка,
	|	Лико_БланкЭтапаВыпуск.Количество,
	|	Лико_БланкЭтапаВыпуск.КоличествоУУ,
	|	Лико_БланкЭтапаВыпуск.СкладОтправитель,
	|	Лико_БланкЭтапаВыпуск.СкладПолучатель,
	|	Лико_БланкЭтапаВыпуск.Серия,
	|	Лико_БланкЭтапаВыпуск.КоличествоУУ
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Выпуск КАК Лико_БланкЭтапаВыпуск
	|ГДЕ
	|	Лико_БланкЭтапаВыпуск.Ссылка = &Ссылка
	|	И Лико_БланкЭтапаВыпуск.СкладОтправитель <> Лико_БланкЭтапаВыпуск.СкладПолучатель
	|	И НЕ Лико_БланкЭтапаВыпуск.ПоАктуРазборки
	|	И НЕ Лико_БланкЭтапаВыпуск.Ссылка.ПоАктуРазборки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтСерии.Номенклатура КАК Номенклатура,
	|	ВтСерии.Характеристика КАК Характеристика,
	|	ВтСерии.Упаковка КАК Упаковка,
	|	СУММА(ВтСерии.Количество) КАК Количество,
	|	ВтСерии.СкладОтправитель КАК СкладОтправитель,
	|	ВтСерии.СкладПолучатель КАК СкладПолучатель,
	|	ВтСерии.Серия КАК Серия,
	|	ЯССМ_ОбъектыНоменклатуры.Уникальный КАК Уникальный,
	|	СУММА(ВтСерии.КоличествоУпаковок) КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ВтОбъектНоменклатуры
	|ИЗ
	|	ВтСерии КАК ВтСерии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
	|		ПО (ЯССМ_ОбъектыНоменклатуры.Серия = ВтСерии.Серия)
	|ГДЕ
	|	ВтСерии.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтСерии.Упаковка,
	|	ВтСерии.СкладОтправитель,
	|	ВтСерии.Номенклатура,
	|	ВтСерии.Характеристика,
	|	ВтСерии.СкладПолучатель,
	|	ЯССМ_ОбъектыНоменклатуры.Уникальный,
	|	ВтСерии.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ВтОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВтОбъектНоменклатуры.Характеристика КАК Характеристика,
	|	ВтОбъектНоменклатуры.СкладОтправитель КАК СкладОтправитель,
	|	ВтОбъектНоменклатуры.СкладПолучатель КАК СкладПолучатель,
	|	ВтОбъектНоменклатуры.Серия КАК Серия,
	|	ВтОбъектНоменклатуры.Уникальный КАК Уникальный,
	|	Лико_СерииНоменклатурыДопСрезПоследних.Организация КАК Организация,
	|	Лико_СерииНоменклатурыДопСрезПоследних.ВидЗапаса КАК ВидЗапаса,
	|	Лико_СерииНоменклатурыДопСрезПоследних.ВидЗапаса КАК Лико_ВидЗапасов,
	|	ВЫБОР
	|		КОГДА ВтОбъектНоменклатуры.Количество < ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА ВтОбъектНоменклатуры.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ВтОбъектНоменклатуры.Количество < ТоварыНаСкладахОстатки.ВНаличииОстаток
	|			ТОГДА ВтОбъектНоменклатуры.Количество
	|		ИНАЧЕ ТоварыНаСкладахОстатки.ВНаличииОстаток
	|	КОНЕЦ КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ВтИтог
	|ИЗ
	|	ВтОбъектНоменклатуры КАК ВтОбъектНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_СерииНоменклатурыДоп.СрезПоследних(
	|				&Дата,
	|				Серия В
	|					(ВЫБРАТЬ
	|						МАКСИМУМ(ОН.Серия)
	|					ИЗ
	|						ВтОбъектНоменклатуры КАК ОН
	|					СГРУППИРОВАТЬ ПО
	|						ОН.Серия)) КАК Лико_СерииНоменклатурыДопСрезПоследних
	|		ПО ВтОбъектНоменклатуры.Серия = Лико_СерииНоменклатурыДопСрезПоследних.Серия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&Дата,
	|				(Номенклатура, Характеристика, Назначение, Склад, Серия) В
	|					(ВЫБРАТЬ
	|						ВтОбъектНоменклатуры.Номенклатура КАК Номенклатура,
	|						ВтОбъектНоменклатуры.Характеристика КАК Характеристика,
	|						ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка) КАК Назначение,
	|						ВтОбъектНоменклатуры.СкладОтправитель КАК СкладОтправитель,
	|						ВтОбъектНоменклатуры.Серия КАК Серия
	|					ИЗ
	|						ВтОбъектНоменклатуры КАК ВтОбъектНоменклатуры
	|					СГРУППИРОВАТЬ ПО
	|						ВтОбъектНоменклатуры.Серия,
	|						ВтОбъектНоменклатуры.СкладОтправитель,
	|						ЗНАЧЕНИЕ(Справочник.Назначения.Пустаяссылка),
	|						ВтОбъектНоменклатуры.Характеристика,
	|						ВтОбъектНоменклатуры.Номенклатура)) КАК ТоварыНаСкладахОстатки
	|		ПО ВтОбъектНоменклатуры.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ВтОбъектНоменклатуры.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|			И ВтОбъектНоменклатуры.Серия = ТоварыНаСкладахОстатки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтИтог.ВНаличииОстаток КАК ВНаличииОстаток,
	|	ВтИтог.Номенклатура КАК Номенклатура,
	|	ВтИтог.Характеристика КАК Характеристика,
	|	ВтИтог.СкладОтправитель КАК СкладОтправитель,
	|	ВтИтог.СкладПолучатель КАК СкладПолучатель,
	|	ВтИтог.Серия КАК Серия,
	|	ВтИтог.Уникальный КАК Уникальный,
	|	ВтИтог.Организация КАК Организация,
	|	ВтИтог.ВидЗапаса КАК ВидЗапаса,
	|	ВтИтог.Лико_ВидЗапасов КАК Лико_ВидЗапасов,
	|	ВтИтог.Количество КАК Количество,
	|	ВтИтог.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	ВтИтог КАК ВтИтог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтИтог.Номенклатура КАК Номенклатура,
	|	ВтИтог.Характеристика КАК Характеристика,
	|	ВтИтог.Лико_ВидЗапасов КАК Лико_ВидЗапасов,
	|	ВтИтог.Организация КАК Организация,
	|	СУММА(ВтИтог.Количество) КАК Количество,
	|	СУММА(ВтИтог.КоличествоУпаковок) КАК КоличествоУпаковок
	|ИЗ
	|	ВтИтог КАК ВтИтог
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтИтог.Номенклатура,
	|	ВтИтог.Характеристика,
	|	ВтИтог.Организация,
	|	ВтИтог.Лико_ВидЗапасов";
	
	Запрос.УстановитьПараметр("Ссылка",Основание.Ссылка ); 
	//Запрос.УстановитьПараметр("Дата",Основание.Дата );
	Запрос.УстановитьПараметр("Дата", Новый Граница(Основание.Ссылка.МоментВремени(), ВидГраницы.Включая));

	
	МассивПакетов = Запрос.ВыполнитьПакет();
	
	ТзСерии =МассивПакетов[3].Выгрузить();	
	ТзТовары =МассивПакетов[4].Выгрузить();	
	
	Если ТзСерии.Количество()=0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	
	ДанныеЗаполнения.Дата = Основание.Дата;
	ДанныеЗаполнения.Организация = Основание.Организация;
	ДанныеЗаполнения.Подразделение = Основание.Подразделение;
	ДанныеЗаполнения.СкладОтправитель = ТзСерии[0].СкладОтправитель;
	ДанныеЗаполнения.СкладПолучатель = ТзСерии[0].СкладПолучатель;
	ДанныеЗаполнения.Товары =  ТзТовары; 
	ДанныеЗаполнения.Серии =  ТзСерии;

	
	
	ДанныеСформированы = Истина;
	
КонецПроцедуры
